###################################################################

# Created by write_sdc on Fri Dec 15 19:38:51 2023

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports rst_n]
set_driving_cell -lib_cell INVX1 [get_ports {sfraddr_w[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {sfraddr_w[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {sfraddr_w[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {sfraddr_r[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {sfraddr_r[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {sfraddr_r[0]}]
set_driving_cell -lib_cell INVX1 [get_ports sfrwe]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {spssn_i[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {spidata_i[0]}]
set_driving_cell -lib_cell INVX1 [get_ports mosii]
set_driving_cell -lib_cell INVX1 [get_ports misoi]
set_driving_cell -lib_cell INVX1 [get_ports scki]
set_driving_cell -lib_cell INVX1 [get_ports ssn]
create_clock [get_ports clk]  -period 41  -waveform {0 20.5}
set_input_delay -clock clk  5  [get_ports rst_n]
set_input_delay -clock clk  5  [get_ports {sfraddr_w[2]}]
set_input_delay -clock clk  5  [get_ports {sfraddr_w[1]}]
set_input_delay -clock clk  5  [get_ports {sfraddr_w[0]}]
set_input_delay -clock clk  5  [get_ports {sfraddr_r[2]}]
set_input_delay -clock clk  5  [get_ports {sfraddr_r[1]}]
set_input_delay -clock clk  5  [get_ports {sfraddr_r[0]}]
set_input_delay -clock clk  5  [get_ports sfrwe]
set_input_delay -clock clk  5  [get_ports {spssn_i[7]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[6]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[5]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[4]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[3]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[2]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[1]}]
set_input_delay -clock clk  5  [get_ports {spssn_i[0]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[7]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[6]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[5]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[4]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[3]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[2]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[1]}]
set_input_delay -clock clk  5  [get_ports {spidata_i[0]}]
set_input_delay -clock clk  5  [get_ports mosii]
set_input_delay -clock clk  5  [get_ports misoi]
set_input_delay -clock clk  5  [get_ports scki]
set_input_delay -clock clk  5  [get_ports ssn]
set_output_delay -clock clk  5  [get_ports {spssn_o[7]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[6]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[5]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[4]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[3]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[2]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[1]}]
set_output_delay -clock clk  5  [get_ports {spssn_o[0]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[7]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[6]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[5]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[4]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[3]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[2]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[1]}]
set_output_delay -clock clk  5  [get_ports {sfr_data_o[0]}]
set_output_delay -clock clk  5  [get_ports intspi]
set_output_delay -clock clk  5  [get_ports mosio]
set_output_delay -clock clk  5  [get_ports misoo]
set_output_delay -clock clk  5  [get_ports scko]
set_output_delay -clock clk  5  [get_ports SPC0]
